performance/mysql8-jemalloc-profiling/logs/old-runs/jemalloc521-profiling_19_26.run.oltp_point_select.16.2021-02-13_075647.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

1,16,240235.12,240235.12,240235.12,0.00,0.00,0.08,0.00,0.00
2,16,242407.95,242407.95,242407.95,0.00,0.00,0.07,0.00,0.00
3,16,244343.65,244343.65,244343.65,0.00,0.00,0.07,0.00,0.00
4,16,242750.74,242750.74,242750.74,0.00,0.00,0.07,0.00,0.00
5,16,243608.38,243608.38,243608.38,0.00,0.00,0.07,0.00,0.00
6,16,243577.55,243577.55,243577.55,0.00,0.00,0.07,0.00,0.00
7,16,242974.07,242974.07,242974.07,0.00,0.00,0.07,0.00,0.00
8,16,240797.44,240797.44,240797.44,0.00,0.00,0.08,0.00,0.00
9,16,244485.40,244485.40,244485.40,0.00,0.00,0.07,0.00,0.00
10,16,241567.76,241567.76,241567.76,0.00,0.00,0.08,0.00,0.00
11,16,243357.65,243357.65,243357.65,0.00,0.00,0.07,0.00,0.00
12,16,242460.92,242460.92,242460.92,0.00,0.00,0.07,0.00,0.00
13,16,243217.74,243218.74,243218.74,0.00,0.00,0.07,0.00,0.00
14,16,242362.46,242361.46,242361.46,0.00,0.00,0.08,0.00,0.00
15,16,243380.49,243380.49,243380.49,0.00,0.00,0.07,0.00,0.00
16,16,242503.84,242503.84,242503.84,0.00,0.00,0.07,0.00,0.00
17,16,243304.98,243304.98,243304.98,0.00,0.00,0.07,0.00,0.00
18,16,243315.08,243315.08,243315.08,0.00,0.00,0.07,0.00,0.00
19,16,244666.06,244666.06,244666.06,0.00,0.00,0.07,0.00,0.00
20,16,241853.22,241853.22,241853.22,0.00,0.00,0.07,0.00,0.00
21,16,242649.17,242649.17,242649.17,0.00,0.00,0.07,0.00,0.00
22,16,243080.25,243080.25,243080.25,0.00,0.00,0.07,0.00,0.00
23,16,243510.63,243510.63,243510.63,0.00,0.00,0.07,0.00,0.00
24,16,241962.55,241962.55,241962.55,0.00,0.00,0.07,0.00,0.00
25,16,243315.39,243315.39,243315.39,0.00,0.00,0.07,0.00,0.00
26,16,243278.22,243278.22,243278.22,0.00,0.00,0.07,0.00,0.00
27,16,245515.24,245516.24,245516.24,0.00,0.00,0.07,0.00,0.00
28,16,243959.51,243958.51,243958.51,0.00,0.00,0.07,0.00,0.00
29,16,243098.05,243098.05,243098.05,0.00,0.00,0.07,0.00,0.00
30,16,242791.83,242791.83,242791.83,0.00,0.00,0.08,0.00,0.00
31,16,242096.48,242096.48,242096.48,0.00,0.00,0.08,0.00,0.00
32,16,243008.29,243009.29,243009.29,0.00,0.00,0.07,0.00,0.00
33,16,243185.02,243184.02,243184.02,0.00,0.00,0.07,0.00,0.00
34,16,242829.12,242829.12,242829.12,0.00,0.00,0.07,0.00,0.00
35,16,244225.23,244225.23,244225.23,0.00,0.00,0.07,0.00,0.00
36,16,242672.28,242672.28,242672.28,0.00,0.00,0.07,0.00,0.00
37,16,242179.10,242180.10,242180.10,0.00,0.00,0.07,0.00,0.00
38,16,242630.50,242629.50,242629.50,0.00,0.00,0.07,0.00,0.00
39,16,242973.79,242973.79,242973.79,0.00,0.00,0.07,0.00,0.00
40,16,243739.94,243739.94,243739.94,0.00,0.00,0.07,0.00,0.00
41,16,243358.89,243358.89,243358.89,0.00,0.00,0.07,0.00,0.00
42,16,242972.84,242972.84,242972.84,0.00,0.00,0.07,0.00,0.00
43,16,243775.72,243775.72,243775.72,0.00,0.00,0.07,0.00,0.00
44,16,241078.41,241078.41,241078.41,0.00,0.00,0.08,0.00,0.00
45,16,242253.52,242253.52,242253.52,0.00,0.00,0.07,0.00,0.00
46,16,242855.81,242855.81,242855.81,0.00,0.00,0.07,0.00,0.00
47,16,240007.32,240007.32,240007.32,0.00,0.00,0.08,0.00,0.00
48,16,242832.07,242832.07,242832.07,0.00,0.00,0.07,0.00,0.00
49,16,243149.78,243149.78,243149.78,0.00,0.00,0.07,0.00,0.00
50,16,242985.26,242985.26,242985.26,0.00,0.00,0.07,0.00,0.00
51,16,243819.02,243819.02,243819.02,0.00,0.00,0.07,0.00,0.00
52,16,241283.89,241283.89,241283.89,0.00,0.00,0.08,0.00,0.00
53,16,241770.13,241770.13,241770.13,0.00,0.00,0.08,0.00,0.00
54,16,243053.22,243053.22,243053.22,0.00,0.00,0.07,0.00,0.00
55,16,242375.59,242375.59,242375.59,0.00,0.00,0.07,0.00,0.00
56,16,241829.44,241830.44,241830.44,0.00,0.00,0.08,0.00,0.00
57,16,243660.82,243659.82,243659.82,0.00,0.00,0.07,0.00,0.00
58,16,240653.44,240653.44,240653.44,0.00,0.00,0.08,0.00,0.00
59,16,242047.58,242047.58,242047.58,0.00,0.00,0.08,0.00,0.00
60,16,242392.42,242392.42,242392.42,0.00,0.00,0.08,0.00,0.00
61,16,242587.83,242587.83,242587.83,0.00,0.00,0.08,0.00,0.00
62,16,242545.47,242545.47,242545.47,0.00,0.00,0.07,0.00,0.00
63,16,242868.68,242868.68,242868.68,0.00,0.00,0.07,0.00,0.00
64,16,242506.79,242507.79,242507.79,0.00,0.00,0.07,0.00,0.00
65,16,241705.45,241704.45,241704.45,0.00,0.00,0.08,0.00,0.00
66,16,244044.85,244044.85,244044.85,0.00,0.00,0.07,0.00,0.00
67,16,242815.14,242815.14,242815.14,0.00,0.00,0.07,0.00,0.00
68,16,241557.73,241557.73,241557.73,0.00,0.00,0.08,0.00,0.00
69,16,243605.09,243606.09,243606.09,0.00,0.00,0.07,0.00,0.00
70,16,243995.52,243994.52,243994.52,0.00,0.00,0.07,0.00,0.00
71,16,243767.71,243767.71,243767.71,0.00,0.00,0.07,0.00,0.00
72,16,242612.29,242612.29,242612.29,0.00,0.00,0.07,0.00,0.00
73,16,244023.78,244023.78,244023.78,0.00,0.00,0.07,0.00,0.00
74,16,244236.34,244236.34,244236.34,0.00,0.00,0.07,0.00,0.00
75,16,242255.56,242255.56,242255.56,0.00,0.00,0.07,0.00,0.00
76,16,239778.46,239778.46,239778.46,0.00,0.00,0.08,0.00,0.00
77,16,243425.90,243425.90,243425.90,0.00,0.00,0.07,0.00,0.00
78,16,244003.64,244004.64,244004.64,0.00,0.00,0.07,0.00,0.00
79,16,244157.01,244156.01,244156.01,0.00,0.00,0.07,0.00,0.00
80,16,243015.36,243015.36,243015.36,0.00,0.00,0.07,0.00,0.00
81,16,242812.58,242813.58,242813.58,0.00,0.00,0.07,0.00,0.00
82,16,243671.62,243670.62,243670.62,0.00,0.00,0.07,0.00,0.00
83,16,243271.66,243271.66,243271.66,0.00,0.00,0.07,0.00,0.00
84,16,240234.99,240235.99,240235.99,0.00,0.00,0.08,0.00,0.00
85,16,242633.93,242632.93,242632.93,0.00,0.00,0.07,0.00,0.00
86,16,241790.00,241790.00,241790.00,0.00,0.00,0.08,0.00,0.00
87,16,243732.24,243732.24,243732.24,0.00,0.00,0.07,0.00,0.00
88,16,242313.34,242313.34,242313.34,0.00,0.00,0.08,0.00,0.00
89,16,243300.66,243300.66,243300.66,0.00,0.00,0.07,0.00,0.00
90,16,243418.67,243419.67,243419.67,0.00,0.00,0.07,0.00,0.00
91,16,243573.18,243572.18,243572.18,0.00,0.00,0.07,0.00,0.00
92,16,243489.75,243489.75,243489.75,0.00,0.00,0.07,0.00,0.00
93,16,243272.99,243272.99,243272.99,0.00,0.00,0.07,0.00,0.00
94,16,242557.79,242557.79,242557.79,0.00,0.00,0.07,0.00,0.00
95,16,244370.99,244370.99,244370.99,0.00,0.00,0.07,0.00,0.00
96,16,241542.38,241542.38,241542.38,0.00,0.00,0.07,0.00,0.00
97,16,243559.93,243559.93,243559.93,0.00,0.00,0.07,0.00,0.00
98,16,242954.51,242954.51,242954.51,0.00,0.00,0.08,0.00,0.00
99,16,243424.33,243424.33,243424.33,0.00,0.00,0.07,0.00,0.00
100,16,242315.70,242318.70,242318.70,0.00,0.00,0.08,0.00,0.00
101,16,243005.40,243002.40,243002.40,0.00,0.00,0.07,0.00,0.00
102,16,242434.50,242434.50,242434.50,0.00,0.00,0.08,0.00,0.00
103,16,243701.05,243701.05,243701.05,0.00,0.00,0.07,0.00,0.00
104,16,241847.38,241847.38,241847.38,0.00,0.00,0.08,0.00,0.00
105,16,241804.75,241804.75,241804.75,0.00,0.00,0.08,0.00,0.00
106,16,243511.84,243511.84,243511.84,0.00,0.00,0.07,0.00,0.00
107,16,244388.73,244388.73,244388.73,0.00,0.00,0.07,0.00,0.00
108,16,243567.96,243567.96,243567.96,0.00,0.00,0.07,0.00,0.00
109,16,244198.97,244198.97,244198.97,0.00,0.00,0.07,0.00,0.00
110,16,244955.51,244955.51,244955.51,0.00,0.00,0.07,0.00,0.00
111,16,243615.57,243615.57,243615.57,0.00,0.00,0.07,0.00,0.00
112,16,241740.23,241740.23,241740.23,0.00,0.00,0.08,0.00,0.00
113,16,242430.78,242430.78,242430.78,0.00,0.00,0.07,0.00,0.00
114,16,242830.48,242830.48,242830.48,0.00,0.00,0.08,0.00,0.00
115,16,243787.37,243787.37,243787.37,0.00,0.00,0.07,0.00,0.00
116,16,242886.98,242886.98,242886.98,0.00,0.00,0.07,0.00,0.00
117,16,243517.50,243517.50,243517.50,0.00,0.00,0.07,0.00,0.00
118,16,242436.51,242436.51,242436.51,0.00,0.00,0.08,0.00,0.00
119,16,243633.03,243633.03,243633.03,0.00,0.00,0.07,0.00,0.00
120,16,242451.30,242451.30,242451.30,0.00,0.00,0.08,0.00,0.00
121,16,243463.09,243463.09,243463.09,0.00,0.00,0.07,0.00,0.00
122,16,242958.22,242958.22,242958.22,0.00,0.00,0.07,0.00,0.00
123,16,239022.78,239022.78,239022.78,0.00,0.00,0.08,0.00,0.00
124,16,241414.71,241414.71,241414.71,0.00,0.00,0.08,0.00,0.00
125,16,243204.73,243204.73,243204.73,0.00,0.00,0.07,0.00,0.00
126,16,243980.93,243980.93,243980.93,0.00,0.00,0.07,0.00,0.00
127,16,243439.21,243439.21,243439.21,0.00,0.00,0.07,0.00,0.00
128,16,242917.49,242917.49,242917.49,0.00,0.00,0.07,0.00,0.00
129,16,242232.34,242232.34,242232.34,0.00,0.00,0.08,0.00,0.00
130,16,243306.56,243306.56,243306.56,0.00,0.00,0.07,0.00,0.00
131,16,243311.62,243311.62,243311.62,0.00,0.00,0.07,0.00,0.00
132,16,243124.92,243124.92,243124.92,0.00,0.00,0.07,0.00,0.00
133,16,244017.27,244017.27,244017.27,0.00,0.00,0.07,0.00,0.00
134,16,243452.89,243452.89,243452.89,0.00,0.00,0.07,0.00,0.00
135,16,244227.76,244227.76,244227.76,0.00,0.00,0.07,0.00,0.00
136,16,242070.79,242070.79,242070.79,0.00,0.00,0.07,0.00,0.00
137,16,243908.54,243908.54,243908.54,0.00,0.00,0.07,0.00,0.00
138,16,243815.68,243815.68,243815.68,0.00,0.00,0.07,0.00,0.00
139,16,242662.50,242662.50,242662.50,0.00,0.00,0.08,0.00,0.00
140,16,242171.21,242171.21,242171.21,0.00,0.00,0.08,0.00,0.00
141,16,242882.63,242882.63,242882.63,0.00,0.00,0.07,0.00,0.00
142,16,243044.27,243044.27,243044.27,0.00,0.00,0.07,0.00,0.00
143,16,243645.64,243645.64,243645.64,0.00,0.00,0.07,0.00,0.00
144,16,241262.35,241262.35,241262.35,0.00,0.00,0.08,0.00,0.00
145,16,243632.32,243632.32,243632.32,0.00,0.00,0.07,0.00,0.00
146,16,243840.87,243840.87,243840.87,0.00,0.00,0.07,0.00,0.00
147,16,243304.27,243304.27,243304.27,0.00,0.00,0.07,0.00,0.00
148,16,243195.93,243195.93,243195.93,0.00,0.00,0.07,0.00,0.00
149,16,243464.21,243464.21,243464.21,0.00,0.00,0.07,0.00,0.00
150,16,244081.56,244081.56,244081.56,0.00,0.00,0.07,0.00,0.00
151,16,242408.10,242408.10,242408.10,0.00,0.00,0.08,0.00,0.00
152,16,243113.33,243113.33,243113.33,0.00,0.00,0.07,0.00,0.00
153,16,243039.93,243039.93,243039.93,0.00,0.00,0.07,0.00,0.00
154,16,242743.75,242744.75,242744.75,0.00,0.00,0.07,0.00,0.00
155,16,242269.52,242268.52,242268.52,0.00,0.00,0.07,0.00,0.00
156,16,241624.95,241624.95,241624.95,0.00,0.00,0.07,0.00,0.00
157,16,243668.61,243668.61,243668.61,0.00,0.00,0.07,0.00,0.00
158,16,242934.59,242934.59,242934.59,0.00,0.00,0.07,0.00,0.00
159,16,243487.88,243487.88,243487.88,0.00,0.00,0.07,0.00,0.00
160,16,242186.91,242186.91,242186.91,0.00,0.00,0.07,0.00,0.00
161,16,243367.07,243367.07,243367.07,0.00,0.00,0.07,0.00,0.00
162,16,242237.25,242237.25,242237.25,0.00,0.00,0.07,0.00,0.00
163,16,244862.36,244862.36,244862.36,0.00,0.00,0.07,0.00,0.00
164,16,243098.63,243098.63,243098.63,0.00,0.00,0.07,0.00,0.00
165,16,243461.92,243461.92,243461.92,0.00,0.00,0.07,0.00,0.00
166,16,241711.17,241711.17,241711.17,0.00,0.00,0.08,0.00,0.00
167,16,244650.66,244650.66,244650.66,0.00,0.00,0.07,0.00,0.00
168,16,243129.49,243129.49,243129.49,0.00,0.00,0.07,0.00,0.00
169,16,243595.37,243595.37,243595.37,0.00,0.00,0.07,0.00,0.00
170,16,242482.07,242482.07,242482.07,0.00,0.00,0.07,0.00,0.00
171,16,243568.52,243568.52,243568.52,0.00,0.00,0.07,0.00,0.00
172,16,242384.56,242384.56,242384.56,0.00,0.00,0.08,0.00,0.00
173,16,242756.60,242756.60,242756.60,0.00,0.00,0.07,0.00,0.00
174,16,244121.58,244121.58,244121.58,0.00,0.00,0.07,0.00,0.00
175,16,243861.69,243861.69,243861.69,0.00,0.00,0.07,0.00,0.00
176,16,242777.72,242777.72,242777.72,0.00,0.00,0.08,0.00,0.00
177,16,243377.38,243377.38,243377.38,0.00,0.00,0.07,0.00,0.00
178,16,244033.66,244033.66,244033.66,0.00,0.00,0.07,0.00,0.00
179,16,242926.93,242926.93,242926.93,0.00,0.00,0.07,0.00,0.00
180,16,241722.55,241722.55,241722.55,0.00,0.00,0.08,0.00,0.00
181,16,242622.75,242622.75,242622.75,0.00,0.00,0.07,0.00,0.00
182,16,243086.08,243087.08,243087.08,0.00,0.00,0.07,0.00,0.00
183,16,242083.27,242082.27,242082.27,0.00,0.00,0.08,0.00,0.00
184,16,242636.76,242636.76,242636.76,0.00,0.00,0.07,0.00,0.00
185,16,242367.73,242367.73,242367.73,0.00,0.00,0.08,0.00,0.00
186,16,243453.52,243453.52,243453.52,0.00,0.00,0.07,0.00,0.00
187,16,244121.59,244121.59,244121.59,0.00,0.00,0.07,0.00,0.00
188,16,241549.42,241549.42,241549.42,0.00,0.00,0.08,0.00,0.00
189,16,242764.20,242764.20,242764.20,0.00,0.00,0.07,0.00,0.00
190,16,242249.57,242249.57,242249.57,0.00,0.00,0.07,0.00,0.00
191,16,243867.73,243867.73,243867.73,0.00,0.00,0.07,0.00,0.00
192,16,241172.35,241172.35,241172.35,0.00,0.00,0.07,0.00,0.00
193,16,242391.01,242391.01,242391.01,0.00,0.00,0.07,0.00,0.00
194,16,243803.63,243804.63,243804.63,0.00,0.00,0.07,0.00,0.00
195,16,243385.17,243384.17,243384.17,0.00,0.00,0.07,0.00,0.00
196,16,242599.50,242599.50,242599.50,0.00,0.00,0.07,0.00,0.00
197,16,242949.25,242949.25,242949.25,0.00,0.00,0.07,0.00,0.00
198,16,244127.78,244128.78,244128.78,0.00,0.00,0.07,0.00,0.00
199,16,245364.37,245363.37,245363.37,0.00,0.00,0.07,0.00,0.00
200,16,243047.61,243047.61,243047.61,0.00,0.00,0.07,0.00,0.00
201,16,243215.93,243217.93,243217.93,0.00,0.00,0.07,0.00,0.00
202,16,242840.20,242838.20,242838.20,0.00,0.00,0.07,0.00,0.00
203,16,241301.13,241301.13,241301.13,0.00,0.00,0.08,0.00,0.00
204,16,243179.86,243179.86,243179.86,0.00,0.00,0.07,0.00,0.00
205,16,243695.63,243695.63,243695.63,0.00,0.00,0.07,0.00,0.00
206,16,243403.51,243403.51,243403.51,0.00,0.00,0.07,0.00,0.00
207,16,244032.27,244032.27,244032.27,0.00,0.00,0.07,0.00,0.00
208,16,242950.04,242950.04,242950.04,0.00,0.00,0.07,0.00,0.00
209,16,243531.74,243531.74,243531.74,0.00,0.00,0.07,0.00,0.00
210,16,242717.23,242717.23,242717.23,0.00,0.00,0.07,0.00,0.00
211,16,243170.99,243170.99,243170.99,0.00,0.00,0.07,0.00,0.00
212,16,242106.05,242106.05,242106.05,0.00,0.00,0.08,0.00,0.00
213,16,242603.68,242603.68,242603.68,0.00,0.00,0.08,0.00,0.00
214,16,243681.55,243682.55,243682.55,0.00,0.00,0.07,0.00,0.00
215,16,243072.03,243071.03,243071.03,0.00,0.00,0.07,0.00,0.00
216,16,241010.22,241010.22,241010.22,0.00,0.00,0.08,0.00,0.00
217,16,242739.34,242739.34,242739.34,0.00,0.00,0.07,0.00,0.00
218,16,242751.77,242751.77,242751.77,0.00,0.00,0.07,0.00,0.00
219,16,243429.67,243429.67,243429.67,0.00,0.00,0.07,0.00,0.00
220,16,242002.85,242002.85,242002.85,0.00,0.00,0.08,0.00,0.00
221,16,243047.87,243047.87,243047.87,0.00,0.00,0.07,0.00,0.00
222,16,243650.48,243650.48,243650.48,0.00,0.00,0.07,0.00,0.00
223,16,242847.37,242847.37,242847.37,0.00,0.00,0.07,0.00,0.00
224,16,242516.17,242516.17,242516.17,0.00,0.00,0.07,0.00,0.00
225,16,243402.81,243403.81,243403.81,0.00,0.00,0.07,0.00,0.00
226,16,242804.08,242803.08,242803.08,0.00,0.00,0.07,0.00,0.00
227,16,243465.23,243465.23,243465.23,0.00,0.00,0.07,0.00,0.00
228,16,240714.39,240715.39,240715.39,0.00,0.00,0.08,0.00,0.00
229,16,243590.98,243589.98,243589.98,0.00,0.00,0.07,0.00,0.00
230,16,242802.47,242802.47,242802.47,0.00,0.00,0.07,0.00,0.00
231,16,242325.99,242325.99,242325.99,0.00,0.00,0.08,0.00,0.00
232,16,240869.52,240869.52,240869.52,0.00,0.00,0.08,0.00,0.00
233,16,242671.92,242671.92,242671.92,0.00,0.00,0.07,0.00,0.00
234,16,242281.46,242281.46,242281.46,0.00,0.00,0.08,0.00,0.00
235,16,243654.73,243654.73,243654.73,0.00,0.00,0.07,0.00,0.00
236,16,242383.22,242383.22,242383.22,0.00,0.00,0.07,0.00,0.00
237,16,243511.82,243511.82,243511.82,0.00,0.00,0.07,0.00,0.00
238,16,241833.81,241833.81,241833.81,0.00,0.00,0.08,0.00,0.00
239,16,243757.71,243757.71,243757.71,0.00,0.00,0.07,0.00,0.00
240,16,240985.85,240985.85,240985.85,0.00,0.00,0.08,0.00,0.00
241,16,243664.59,243664.59,243664.59,0.00,0.00,0.07,0.00,0.00
242,16,243934.95,243934.95,243934.95,0.00,0.00,0.07,0.00,0.00
243,16,243863.75,243863.75,243863.75,0.00,0.00,0.07,0.00,0.00
244,16,242990.92,242990.92,242990.92,0.00,0.00,0.07,0.00,0.00
245,16,244006.36,244006.36,244006.36,0.00,0.00,0.07,0.00,0.00
246,16,244542.44,244542.44,244542.44,0.00,0.00,0.07,0.00,0.00
247,16,243380.82,243380.82,243380.82,0.00,0.00,0.07,0.00,0.00
248,16,241130.12,241130.12,241130.12,0.00,0.00,0.08,0.00,0.00
249,16,242817.77,242818.77,242818.77,0.00,0.00,0.07,0.00,0.00
250,16,243456.86,243455.86,243455.86,0.00,0.00,0.07,0.00,0.00
251,16,242545.30,242545.30,242545.30,0.00,0.00,0.08,0.00,0.00
252,16,242035.96,242036.96,242036.96,0.00,0.00,0.07,0.00,0.00
253,16,243426.29,243425.29,243425.29,0.00,0.00,0.07,0.00,0.00
254,16,244248.92,244248.92,244248.92,0.00,0.00,0.07,0.00,0.00
255,16,241327.14,241328.14,241328.14,0.00,0.00,0.08,0.00,0.00
256,16,241859.80,241858.80,241858.80,0.00,0.00,0.08,0.00,0.00
257,16,243394.50,243394.50,243394.50,0.00,0.00,0.07,0.00,0.00
258,16,244043.75,244043.75,244043.75,0.00,0.00,0.07,0.00,0.00
259,16,244344.86,244345.86,244345.86,0.00,0.00,0.07,0.00,0.00
260,16,242445.29,242444.29,242444.29,0.00,0.00,0.07,0.00,0.00
261,16,243816.07,243816.07,243816.07,0.00,0.00,0.07,0.00,0.00
262,16,243936.31,243936.31,243936.31,0.00,0.00,0.07,0.00,0.00
263,16,242324.50,242324.50,242324.50,0.00,0.00,0.08,0.00,0.00
264,16,242402.31,242402.31,242402.31,0.00,0.00,0.07,0.00,0.00
265,16,244289.86,244289.86,244289.86,0.00,0.00,0.07,0.00,0.00
266,16,242966.52,242966.52,242966.52,0.00,0.00,0.07,0.00,0.00
267,16,243145.93,243145.93,243145.93,0.00,0.00,0.07,0.00,0.00
268,16,243263.54,243263.54,243263.54,0.00,0.00,0.07,0.00,0.00
269,16,244356.44,244356.44,244356.44,0.00,0.00,0.07,0.00,0.00
270,16,243292.72,243292.72,243292.72,0.00,0.00,0.07,0.00,0.00
271,16,242996.06,242997.06,242997.06,0.00,0.00,0.07,0.00,0.00
272,16,242864.06,242863.06,242863.06,0.00,0.00,0.07,0.00,0.00
273,16,243470.90,243470.90,243470.90,0.00,0.00,0.07,0.00,0.00
274,16,243545.29,243545.29,243545.29,0.00,0.00,0.07,0.00,0.00
275,16,242477.00,242477.00,242477.00,0.00,0.00,0.07,0.00,0.00
276,16,241240.31,241240.31,241240.31,0.00,0.00,0.08,0.00,0.00
277,16,243594.28,243594.28,243594.28,0.00,0.00,0.07,0.00,0.00
278,16,243550.99,243550.99,243550.99,0.00,0.00,0.07,0.00,0.00
279,16,240649.11,240649.11,240649.11,0.00,0.00,0.08,0.00,0.00
280,16,242760.69,242760.69,242760.69,0.00,0.00,0.07,0.00,0.00
281,16,242692.26,242692.26,242692.26,0.00,0.00,0.07,0.00,0.00
282,16,242079.98,242079.98,242079.98,0.00,0.00,0.07,0.00,0.00
283,16,243033.77,243033.77,243033.77,0.00,0.00,0.07,0.00,0.00
284,16,243373.73,243373.73,243373.73,0.00,0.00,0.07,0.00,0.00
285,16,243402.74,243402.74,243402.74,0.00,0.00,0.07,0.00,0.00
286,16,244432.36,244432.36,244432.36,0.00,0.00,0.07,0.00,0.00
287,16,243402.75,243402.75,243402.75,0.00,0.00,0.08,0.00,0.00
288,16,241054.67,241054.67,241054.67,0.00,0.00,0.08,0.00,0.00
289,16,243863.61,243863.61,243863.61,0.00,0.00,0.07,0.00,0.00
290,16,242884.75,242884.75,242884.75,0.00,0.00,0.07,0.00,0.00
291,16,244199.41,244199.41,244199.41,0.00,0.00,0.07,0.00,0.00
292,16,241279.64,241279.64,241279.64,0.00,0.00,0.08,0.00,0.00
293,16,242849.29,242849.29,242849.29,0.00,0.00,0.07,0.00,0.00
294,16,243485.45,243485.45,243485.45,0.00,0.00,0.07,0.00,0.00
295,16,240721.58,240721.58,240721.58,0.00,0.00,0.08,0.00,0.00
296,16,243146.01,243146.01,243146.01,0.00,0.00,0.07,0.00,0.00
297,16,243625.90,243625.90,243625.90,0.00,0.00,0.07,0.00,0.00
298,16,244164.49,244164.49,244164.49,0.00,0.00,0.07,0.00,0.00
299,16,244397.56,244397.56,244397.56,0.00,0.00,0.07,0.00,0.00
300,16,242043.15,242043.15,242043.15,0.00,0.00,0.07,0.00,0.00
SQL statistics:
    queries performed:
        read:                            72886272
        write:                           0
        other:                           0
        total:                           72886272
    transactions:                        72886272 (242951.38 per sec.)
    queries:                             72886272 (242951.38 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0022s
    total number of events:              72886272

Latency (ms):
         min:                                    0.05
         avg:                                    0.07
         max:                                    3.97
         95th percentile:                        0.07
         sum:                              4766717.56

Threads fairness:
    events (avg/stddev):           4555392.0000/16524.35
    execution time (avg/stddev):   297.9198/0.06